       01 CUSTOMER-RECORD.
           05 CUSTOMER-ID           PIC X(8).
           05 CUSTOMER-NAME         PIC X(30).
           05 AMOUNT                PIC 9(8).
           05 DATE                  PIC X(8).
           05 STATUS                PIC X(1).
        