      01  TELEMETRY-RECORD.
         05  MISSION-ID       PIC 9(4) COMP.
         05  TIMESTAMP        PIC 9(9)V9(6) COMP-3.
         05  ALTITUDE         PIC S9(5)V9(2) COMP-3.
         05  SENSOR1          PIC 9(5)V9(2).
         05  SENSOR2          PIC 9(5)V9(2).
         05  SENSOR3          PIC 9(5)V9(2).
         05  SENSOR4          PIC 9(5)V9(2).
         05  SENSOR5          PIC 9(5)V9(2).